---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Efficacy
source: html/023f1bcc-9f1e-08cd-af69-67593c7da9a6.htm
---
# Autodesk.Revit.DB.SpecTypeId.Efficacy Property

Efficacy, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId Efficacy { get; }
```